export const ADJECTIVES = [
    '沉思的', '聪慧的', '聪明的',
    '奋斗的',
    '活泼的',
    '激情的', '健谈的',
    '开朗的', '可爱的',
    '乐观的', '理想的',
    '美丽的',
    '热情的',
    '温暖的',
    '幽默的', '友好的', '有趣的',
    '专心的', '卓越的', '茁壮的'
]

export const BLOCKS = [
    '安山岩',
    '白桦原木',
    '草方块', '丛林原木',
    '浮冰',
    '工作台',
    '海绵', '黑曜石', '红沙', '红砂岩', '红石块', '花岗岩',
    '基岩', '金合欢原木', '金块',
    '绿宝石块',
    '末地石', '末影箱',
    '泥土', '粘土块',
    '蒲公英',
    '青金石块',
    '熔岩',
    '砂岩', '闪长岩', '深色橡木原木', '石头', '石英块',
    '陶瓦', 'TNT',
    '箱子', '橡木原木', '信标', '玄武岩', '雪块',
    '虞美人', '圆石', '云杉原木',
    '紫颂花', '钻石块'
]

export function generateUsername(): string {
    return ADJECTIVES[Math.floor(Math.random() * ADJECTIVES.length)] + BLOCKS[Math.floor(Math.random() * BLOCKS.length)]
}